In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\abhishek kashyap\anaconda3\lib\site-packages (8.0.29)
Collecting protobuf>=3.0.0
  Downloading protobuf-4.21.1-cp38-cp38-win_amd64.whl (524 kB)
Installing collected packages: protobuf
Successfully installed protobuf-4.21.1

In [ ]:
# Establishing Connection

In [3]:
import mysql.connector as connection

try:
    mydb = connection.connect(host="localhost",user="root", passwd="Abhishek@1067",use_pure=True)
    # check if the connection is established

    query = "SHOW DATABASES"

    cursor = mydb.cursor() #create a cursor to execute queries
    cursor.execute(query)
    print(cursor.fetchall())

except Exception as e:
    mydb.close()
    print(str(e))

[('information_schema',), ('my_database',), ('mysql',), ('performance_schema',), ('personal',), ('sales',), ('sys',)]

In [4]:
connection.connect(host="localhost",user="root", passwd="Abhishek@1067",use_pure=True)

In [5]:
conn = connection.connect(host="localhost",user="root", passwd="Abhishek@1067",use_pure=True)

In [11]:
cur = conn.cursor()

In [12]:
cur.execute("show databases")

In [13]:
res = cur.fetchall()
res

[('abhishekdb',),
 ('information_schema',),
 ('my_database',),
 ('mysql',),
 ('performance_schema',),
 ('personal',),
 ('sales',),
 ('studentrecord',),
 ('sys',)]

In [16]:
#cur.execute("create database ABhishekDB")

In [24]:
import mysql.connector as connection

In [26]:
conn = connection.connect(host="localhost",user="root",passwd="Abhishek@1067",use_pure=True)

In [27]:
cur = conn.cursor()

In [28]:
cur.execute("create database AbhishekDatabase")

In [32]:
cur = conn.cursor()

In [33]:
cur.execute("show databases")

In [34]:
res = cur.fetchall()

In [35]:
res

[('abhishekdatabase',),
 ('abhishekdb',),
 ('information_schema',),
 ('my_database',),
 ('mysql',),
 ('performance_schema',),
 ('personal',),
 ('sales',),
 ('studentrecord',),
 ('sys',)]

In [38]:
cur = conn.cursor()

In [39]:
cur.execute("show databases")

In [40]:
cur.fetchall()

[('abhishekdatabase',),
 ('abhishekdb',),
 ('information_schema',),
 ('my_database',),
 ('mysql',),
 ('performance_schema',),
 ('personal',),
 ('sales',),
 ('studentrecord',),
 ('sys',)]

In [41]:
# Creating Table

In [42]:
mydb = connection.connect(host="localhost",database="Abhishekdb",user="root",passwd="Abhishek@1067",use_pure=True)

In [43]:
mydb.is_connected()

True

In [44]:
cur = mydb.cursor()
cur.execute("create table Test(Roll_No INT(5), Name VARCHAR(20), BirhtDate DATE)")

In [45]:
# Inserting data into table

In [48]:
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")

In [49]:
mydb.commit()

In [51]:
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")
cur.execute("insert into test values(22, 'Abhishek', '1997-03-08')")

In [52]:
mydb.commit()

In [53]:
# Selecting data from table

In [54]:
cur.execute("select * from test")

In [55]:
cur.fetchall()

[(22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8)),
 (22, 'Abhishek', datetime.date(1997, 3, 8))]

In [59]:
cur.execute("select * from test")

In [60]:
res = cur.fetchall()

In [64]:
for i in res:
    print(i)

(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))
(22, 'Abhishek', datetime.date(1997, 3, 8))

In [63]:
for i in res:
    print(i[1])

Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek
Abhishek

In [65]:
cur.execute("select Name, Roll_No from test")

In [66]:
cur.fetchall()

[('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22),
 ('Abhishek', 22)]

In [67]:
# Using pandas extracting data from table

In [68]:
import pandas as pd

In [69]:
mydb

In [72]:
pd.read_sql("select * from Abhishekdb.test",mydb)

    Roll_No      Name   BirhtDate
0        22  Abhishek  1997-03-08
1        22  Abhishek  1997-03-08
2        22  Abhishek  1997-03-08
3        22  Abhishek  1997-03-08
4        22  Abhishek  1997-03-08
5        22  Abhishek  1997-03-08
6        22  Abhishek  1997-03-08
7        22  Abhishek  1997-03-08
8        22  Abhishek  1997-03-08
9        22  Abhishek  1997-03-08
10       22  Abhishek  1997-03-08
11       22  Abhishek  1997-03-08

In [77]:
pd.read_sql("select Name,BirhtDate Date_of_Birth from Abhishekdb.test",mydb)

        Name Date_of_Birth
0   Abhishek    1997-03-08
1   Abhishek    1997-03-08
2   Abhishek    1997-03-08
3   Abhishek    1997-03-08
4   Abhishek    1997-03-08
5   Abhishek    1997-03-08
6   Abhishek    1997-03-08
7   Abhishek    1997-03-08
8   Abhishek    1997-03-08
9   Abhishek    1997-03-08
10  Abhishek    1997-03-08
11  Abhishek    1997-03-08

In [78]:
a = pd.read_sql("select Name,BirhtDate Date_of_Birth from Abhishekdb.test",mydb)

In [79]:
a

        Name Date_of_Birth
0   Abhishek    1997-03-08
1   Abhishek    1997-03-08
2   Abhishek    1997-03-08
3   Abhishek    1997-03-08
4   Abhishek    1997-03-08
5   Abhishek    1997-03-08
6   Abhishek    1997-03-08
7   Abhishek    1997-03-08
8   Abhishek    1997-03-08
9   Abhishek    1997-03-08
10  Abhishek    1997-03-08
11  Abhishek    1997-03-08

In [80]:
a.to_csv("MyFirstSQLfile.csv")

In [82]:
data = pd.read_csv("MyFirstSQLfile.csv")

In [87]:
data

    Unnamed: 0      Name Date_of_Birth
0            0  Abhishek    1997-03-08
1            1  Abhishek    1997-03-08
2            2  Abhishek    1997-03-08
3            3  Abhishek    1997-03-08
4            4  Abhishek    1997-03-08
5            5  Abhishek    1997-03-08
6            6  Abhishek    1997-03-08
7            7  Abhishek    1997-03-08
8            8  Abhishek    1997-03-08
9            9  Abhishek    1997-03-08
10          10  Abhishek    1997-03-08
11          11  Abhishek    1997-03-08

In [94]:
# data in the current directory

In [95]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 1A7E-3A40

 Directory of C:\Users\Abhishek Kashyap

08-06-2022  01:56    <DIR>          .
08-06-2022  01:56    <DIR>          ..
05-06-2022  17:47    <DIR>          .astropy
04-06-2022  02:00             1,649 .bash_history
21-05-2022  01:07    <DIR>          .conda
26-02-2022  15:41                25 .condarc
26-02-2022  15:40    <DIR>          .continuum
03-06-2022  01:29                69 .gitconfig
08-06-2022  00:00    <DIR>          .ipynb_checkpoints
24-02-2022  01:44    <DIR>          .ipython
26-02-2022  03:31    <DIR>          .jupyter
26-05-2022  02:27    <DIR>          .matplotlib
19-04-2022  17:18    <DIR>          .spss
03-06-2022  01:36    <DIR>          .ssh
21-02-2022  23:26    <DIR>          .vscode
21-02-2022  23:53    <DIR>          3D Objects
17-03-2022  00:08    <DIR>          anaconda3
28-02-2022  19:55            82,021 Car_Fuel.ipynb
21-02-2022  23:53    <DIR>          Contacts
05-06-2022  12:13    <DIR>          Desktop
03-06-2022  01:00    <DIR>          Documents
07-06-2022  02:25    <DIR>          Downloads
21-02-2022  23:53    <DIR>          Favorites
16-03-2022  22:47            35,387 Fraud Detection.ipynb
16-03-2022  21:53         7,637,714 fresh_sample.csv
05-06-2022  17:04             4,168 ineuron class 05-06-2022.ipynb
28-05-2022  18:42             7,297 ineuron class 28-05-2022.ipynb
29-05-2022  17:59             7,088 ineuron class 29-05-2022.ipynb
08-06-2022  01:56            29,265 ineuron database Class.ipynb
29-05-2022  14:38            10,101 ineuron_Task No - 3.ipynb
27-02-2022  03:01            35,004 Iris_dataset Practice.ipynb
21-02-2022  23:53    <DIR>          Links
26-05-2022  23:25    <DIR>          Microsoft
21-02-2022  23:53    <DIR>          Music
25-03-2022  22:03           664,295 my_submission_file.csv
08-06-2022  01:42               299 MyFirstSQLfile.csv
07-06-2022  12:01    <DIR>          OneDrive
27-04-2022  15:09    <DIR>          Pictures
02-04-2022  17:19             3,171 Practice in data science Notebook.ipynb
07-06-2022  12:14    <DIR>          PycharmProjects
17-03-2022  01:03            59,458 sample_fraud_detection.ipynb
21-02-2022  23:53    <DIR>          Saved Games
21-02-2022  23:55    <DIR>          Searches
21-03-2022  02:51        16,795,170 sub_file.csv
25-03-2022  22:04           152,249 Swiss Re Predict Accident Risk Score.ipynb
21-03-2022  03:22            33,042 Swisss Re Test File.ipynb
03-06-2022  20:14            14,155 Task No - 1  and 2 Solution.ipynb
23-04-2022  10:27    <DIR>          Tracing
02-03-2022  14:12    <DIR>          Videos
              20 File(s)     25,571,627 bytes
              29 Dir(s)  114,251,005,952 bytes free